submission_logs/2_1_one_middleware/64/24/1-0/0/memtier/1.log
2         Threads
24        Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        4460.66          ---          ---     10.75600     18018.60 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      4460.66         0.00         0.00     10.75600     18018.60 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.900         0.00
SET       0.990         0.00
SET       1.000         0.00
SET       1.100         0.00
SET       1.200         0.01
SET       1.300         0.02
SET       1.400         0.04
SET       1.500         0.07
SET       1.600         0.10
SET       1.700         0.14
SET       1.800         0.19
SET       1.900         0.25
SET       2.000         0.31
SET       2.100         0.39
SET       2.200         0.47
SET       2.300         0.57
SET       2.400         0.68
SET       2.500         0.82
SET       2.600         0.99
SET       2.700         1.19
SET       2.800         1.41
SET       2.900         1.67
SET       3.000         1.99
SET       3.100         2.34
SET       3.200         2.73
SET       3.300         3.15
SET       3.400         3.60
SET       3.500         4.07
SET       3.600         4.58
SET       3.700         5.11
SET       3.800         5.62
SET       3.900         6.19
SET       4.000         6.76
SET       4.100         7.34
SET       4.200         7.90
SET       4.300         8.47
SET       4.400         9.04
SET       4.500         9.59
SET       4.600        10.12
SET       4.700        10.63
SET       4.800        11.15
SET       4.900        11.67
SET       5.000        12.15
SET       5.100        12.59
SET       5.200        13.00
SET       5.300        13.40
SET       5.400        13.80
SET       5.500        14.19
SET       5.600        14.55
SET       5.700        14.94
SET       5.800        15.30
SET       5.900        15.65
SET       6.000        15.98
SET       6.100        16.29
SET       6.200        16.60
SET       6.300        16.89
SET       6.400        17.17
SET       6.500        17.45
SET       6.600        17.70
SET       6.700        17.97
SET       6.800        18.22
SET       6.900        18.47
SET       7.000        18.73
SET       7.100        18.97
SET       7.200        19.23
SET       7.300        19.47
SET       7.400        19.71
SET       7.500        19.95
SET       7.600        20.20
SET       7.700        20.45
SET       7.800        20.73
SET       7.900        21.00
SET       8.000        21.28
SET       8.100        21.59
SET       8.200        21.90
SET       8.300        22.25
SET       8.400        22.61
SET       8.500        23.00
SET       8.600        23.44
SET       8.700        23.90
SET       8.800        24.43
SET       8.900        24.99
SET       9.000        25.63
SET       9.100        26.33
SET       9.200        27.10
SET       9.300        27.93
SET       9.400        28.82
SET       9.500        29.82
SET       9.600        30.95
SET       9.700        32.11
SET       9.800        33.38
SET       9.900        34.74
SET      10.000        43.39
SET      11.000        61.61
SET      12.000        75.30
SET      13.000        82.88
SET      14.000        87.07
SET      15.000        90.01
SET      16.000        92.24
SET      17.000        93.86
SET      18.000        95.25
SET      19.000        96.48
SET      20.000        97.40
SET      21.000        98.08
SET      22.000        98.56
SET      23.000        98.92
SET      24.000        99.17
SET      25.000        99.37
SET      26.000        99.52
SET      27.000        99.64
SET      28.000        99.72
SET      29.000        99.78
SET      30.000        99.82
SET      31.000        99.85
SET      32.000        99.88
SET      33.000        99.90
SET      34.000        99.92
SET      35.000        99.94
SET      36.000        99.95
SET      37.000        99.95
SET      38.000        99.96
SET      39.000        99.96
SET      40.000        99.97
SET      41.000        99.97
SET      42.000        99.97
SET      43.000        99.98
SET      44.000        99.98
SET      45.000        99.99
SET      46.000        99.99
SET      47.000        99.99
SET      48.000        99.99
SET      49.000        99.99
SET      50.000        99.99
SET      52.000        99.99
SET      53.000        99.99
SET      54.000        99.99
SET      57.000        99.99
SET      58.000        99.99
SET      59.000        99.99
SET      60.000       100.00
SET      61.000       100.00
SET      62.000       100.00
SET      66.000       100.00
SET      68.000       100.00
SET      69.000       100.00
SET      70.000       100.00
SET      77.000       100.00
SET      82.000       100.00
SET      93.000       100.00
SET     110.000       100.00
---
---